simpleFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-3;//1e-06;
        relTol          1e-3;//0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-3;//1e-06;
        relTol          1e-3;//0;
    }
    
    rho 
    {
        solver          PCG;
        smoother        DIC;
        tolerance       1e-3;//1e-06;
        relTol          1e-3;//0;
    }
    e 
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-3;//1e-06;
        relTol          1e-3;//0;
    }
}

SIMPLE 
{
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    fields
    {
        p               0.3;
        U               0.7;
    }
    equations
    {
        U               0.7;
    }
}



// ************************************************************************* //
